Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/react-without-es6_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: react-without-es6 title: React Without ES6 permalink: docs/react-without-es6.html ---
ja: --- id: react-without-es6 title: ES6 なしで React を使う permalink: docs/react-without-es6.html ---

source: Normally you would define a React component as a plain JavaScript class:
ja: 通常、React コンポーネントはプレーンな JavaScript クラスとして定義されます。

source: If you don't use ES6 yet, you may use the `create-react-class` module instead:
ja: もしあなたがまだ ES6 を使っていないのであれば、代わりに `create-react-class` モジュールを使うことができます。

source: The API of ES6 classes is similar to `createReactClass()` with a few exceptions.
ja: ES6 のクラス API は `createReactClass()` とよく似ていますが、いくつかの例外があります。

source: ## Declaring Default Props {#declaring-default-props}
ja: ## デフォルト props の宣言 {#declaring-default-props}

source: With functions and ES6 classes `defaultProps` is defined as a property on the component itself:
ja: 関数や ES6 クラスでは、`defaultProps` はコンポーネント自体のプロパティとして定義されます。

source: With `createReactClass()`, you need to define `getDefaultProps()` as a function on the passed object:
ja: `createReactClass()` の場合、渡されるオブジェクト内の関数として `getDefaultProps()` を定義する必要があります。

source: ## Setting the Initial State {#setting-the-initial-state}
ja: ## state の初期値の設定 {#setting-the-initial-state}

source: In ES6 classes, you can define the initial state by assigning `this.state` in the constructor:
ja: ES6 クラスでは、コンストラクタで `this.state` へ代入することで state の初期値を定義できます。

source: With `createReactClass()`, you have to provide a separate `getInitialState` method that returns the initial state:
ja: `createReactClass()` の場合、state の初期値を返す `getInitialState` メソッドを別途用意しなければなりません。

source: ## Autobinding {#autobinding}
ja: ## 自動バインド {#autobinding}

source: In React components declared as ES6 classes, methods follow the same semantics as regular ES6 classes.
ja: ES6 クラスとして宣言された React コンポーネントでは、メソッドは通常の ES6 クラスと同様のセマンティクスに従います。

source: This means that they don't automatically bind `this` to the instance.
ja: つまり、`this` がそのインスタンスへ自動的にバインドされることはありません。

source: You'll have to explicitly use `.bind(this)` in the constructor:
ja: コンストラクタで明示的に `.bind(this)` を利用する必要があります。

source: With `createReactClass()`, this is not necessary because it binds all methods:
ja: `createReactClass()` の場合は全てのメソッドがバインドされるため、明示的なバインドは必要ありません。

source: This means writing ES6 classes comes with a little more boilerplate code for event handlers, but the upside is slightly better performance in large applications.
ja: これはつまり、ES6 クラスで書くとイベントハンドラのための定型文が少し多くなってしまうということなのですが、一方では大きなアプリケーションの場合にわずかながらパフォーマンスが向上するという側面もあります。

source: If the boilerplate code is too unattractive to you, you may enable the **experimental** [Class Properties](https://babeljs.io/docs/plugins/transform-class-properties/) syntax proposal with Babel:
ja: この定型文的コードがあまりに醜く感じられる場合、Babel を使って**実験的**な [Class Properties](https://babeljs.io/docs/plugins/transform-class-properties/) 構文提案を有効にするとよいかもしれません。

source: Please note that the syntax above is **experimental** and the syntax may change, or the proposal might not make it into the language.
ja: 上記の構文は**実験的**なものであり、構文が変わるかもしれないこと、あるいは言語に取り入れられないかもしれないことに留意してください。

source: If you'd rather play it safe, you have a few options:
ja: 安全にやりたい場合は他の選択肢もあります。

source: * Bind methods in the constructor.
ja: * コンストラクタでメソッドをバインドする。

source: * Use arrow functions, e.g. `onClick={(e) => this.handleClick(e)}`.
ja: * 例えば `onClick={(e) => this.handleClick(e)}` のような形でアロー関数を利用する。

source: * Keep using `createReactClass`.
ja: * 引き続き `createReactClass` を利用する。

source: ## Mixins {#mixins}
ja: ## ミックスイン {#mixins}

source: >**Note:** > >ES6 launched without any mixin support.
ja: >**補足：** > >ES6 はミックスインのサポートを含んでいません。

source: Therefore, there is no support for mixins when you use React with ES6 classes.
ja: 従って、React を ES6 クラスで使う場合にミックスインのサポートはありません。

source: > >**We also found numerous issues in codebases using mixins, [and don't recommend using them in the new code](/blog/2016/07/13/mixins-considered-harmful.html).** > >This section exists only for the reference.
ja: > >**加えて、ミックスインを用いたコードによる多くの問題が見つかっており、[新規コードで利用することは推奨されません](/blog/2016/07/13/mixins-considered-harmful.html)。** > >この節は参考のためだけに存在します。

source: Sometimes very different components may share some common functionality.
ja: 時には同じ機能が全く異なるコンポーネント間で共有されることがあります。

source: These are sometimes called [cross-cutting concerns](https://en.wikipedia.org/wiki/Cross-cutting_concern).
ja: これは[横断的関心事 (cross-cutting concerns)](https://en.wikipedia.org/wiki/Cross-cutting_concern) と呼ばれることがあります。

source: `createReactClass` lets you use a legacy `mixins` system for that.
ja: `createReactClass` であれば、横断的関心事のためにレガシーな `mixins` 機能を使うことができます。

source: One common use case is a component wanting to update itself on a time interval.
ja: よくある利用例のひとつは、一定時間ごとに自分自身を更新するコンポーネントです。

source: It's easy to use `setInterval()`, but it's important to cancel your interval when you don't need it anymore to save memory.
ja: `setInterval()` を使うのは簡単ですが、その場合はメモリ節約のため、コンポーネントが不要になった際にキャンセルすることが重要です。

source: React provides [lifecycle methods](/docs/react-component.html#the-component-lifecycle) that let you know when a component is about to be created or destroyed.
ja: React は[ライフサイクルメソッド](/docs/react-component.html#the-component-lifecycle)を提供しており、コンポーネントが生成、破棄されるときに知らせてくれます。

source: Let's create a simple mixin that uses these methods to provide an easy `setInterval()` function that will automatically get cleaned up when your component is destroyed.
ja: 次のようなシンプルなミックスインを作ってみましょう。このミックスインのメソッドは簡単な `setInterval()` 機能を提供し、コンポーネントが破棄されるタイミングで自動的にクリーンアップされます。

source: If a component is using multiple mixins and several mixins define the same lifecycle method (i.e. several mixins want to do some cleanup when the component is destroyed), all of the lifecycle methods are guaranteed to be called.
ja: コンポーネントが複数のミックスインを使っており、いくつかのミックスインが同じライフサイクルメソッドを定義している場合（例：コンポーネント破棄時に複数のミックスインがクリーンアップ処理をする）、全てのライフサイクルメソッドが呼ばれることが保証されています。

source: Methods defined on mixins run in the order mixins were listed, followed by a method call on the component.
ja: ミックスインで定義されているメソッドはミックスインとして列挙された順に実行され、そのあとにコンポーネントのメソッドが呼ばれます。
